*> Mission: Show how to exchange a COMPLEX data STRUCTURE / GROUP.
*> GnuCOBOL: cobc -x -j -free BannerClock.cob
*> Source: https://github.com/soft9000/COBOL/tree/master/TheMajority/BANNER
IDENTIFICATION DIVISION.
PROGRAM-ID. BANNER-EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "WS_CURRENT_DATE.cpy".
COPY 'CB_RASTER_IO.cpy'.

01 RASTER_SS PIC 99.

PROCEDURE DIVISION.
INITIALIZE RASTER-IO.
MOVE 42 TO RASTER_RETURN_CODE.
MOVE FUNCTION CURRENT-DATE to WS-CURRENT-DATE-GROUP.
STRING  WS-CURRENT-HOURS '.'
        WS-CURRENT-MINUTE '.' 
        WS-CURRENT-SECOND
    INTO BANNER_FIELD.
CALL 'PROC_BANNER' USING RASTER-IO.
IF RASTER_SUCCESS
    DISPLAY "Raster is well!"  *> New!
    PERFORM VARYING RASTER_SS 
    FROM 1 BY 1 UNTIL RASTER_SS > RASTER_LINES
    DISPLAY '['NINE_LINES(RASTER_SS)']'
    END-PERFORM
ELSE
    DISPLAY 'Rasterization Error?'.
DISPLAY "N.E.O.J".
GOBACK.

END PROGRAM BANNER-EXAMPLE.

COPY "PROC_BANNER8.cob".
