01 RASTER_CODE_SUCCESS    PIC 9      VALUE 1.
01 RASTER_CODE_WARNING    PIC 9      VALUE 4.
01 RASTER_CODE_EXCEPTION  PIC 9      VALUE 8.
01 RASTER_CODE_ERROR      PIC 9      VALUE 9.

01 RASTER_LINES           PIC 9      VALUE 9.

      
