01 PARAMS-CLS.
   05 SCREEN_WIDTH  PIC 99 VALUE 80.
   05 SCREEN_HEIGHT PIC 99 VALUE 25.
   05 COLOR_FORE    PIC 9  VALUE WHITE. *> Predefined!
   05 COLOR_BACK    PIC 9  VALUE BLACK.
   05 SCREEN_CHAR   PIC X  VALUE ' '.
      
