*> Mission: Demonstrate a colorized console clock.
*> GnuCOBOL: cobc -x -j -free ConstantClock.cob
*> Source: https://github.com/soft9000/COBOL/tree/master/GbuCOBOL/BANNER
IDENTIFICATION DIVISION.
PROGRAM-ID. CONSTANT-CLOCK.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "WS_COLORS.cpy". *> New: Another CONSTANT effort.
COPY "WS_CURRENT_DATE.cpy".
COPY 'CB_RASTER_IO.cpy'.

01 RASTER_SS PIC 99.

PROCEDURE DIVISION.
PERFORM FOREVER
    INITIALIZE RASTER-IO
    MOVE FUNCTION CURRENT-DATE to WS-CURRENT-DATE-GROUP
    STRING  WS-CURRENT-HOURS '.'
            WS-CURRENT-MINUTE '.' 
            WS-CURRENT-SECOND
        INTO BANNER_FIELD
    CALL 'PROC_BANNER' USING RASTER-IO
    IF RASTER_SUCCESS
        PERFORM VARYING RASTER_SS 
        FROM 1 BY 1 UNTIL RASTER_SS > RASTER_LINES
        *> PERFORM DISPLAY_FLAT
        PERFORM DISPLAY_COLORIZED
        END-PERFORM
        CALL "C$SLEEP" USING 1 END-CALL
    ELSE
        DISPLAY 'Rasterization Error?'
        EXIT PROGRAM
END-PERFORM.

DISPLAY "N.E.O.J".
GOBACK.

DISPLAY_FLAT.
    DISPLAY NINE_LINES(RASTER_SS)

DISPLAY_COLORIZED.
    DISPLAY NINE_LINES(RASTER_SS) AT LINE RASTER_SS COLUMN 10 
        WITH FOREGROUND-COLOR IS BLUE   
        BACKGROUND-COLOR      IS BLACK.

END PROGRAM CONSTANT-CLOCK.

COPY "PROC_BANNER9.cob".
