*> Mission: Show how RECEIVING a COMPLEX STRUCTURE is NOT POSSIBLE.
*> GnuCOBOL: cobc -x -j -free BANNER_EXAMPLE6.cob
*> Source: https://github.com/soft9000/COBOL/tree/master/TheCommons/BANNER
IDENTIFICATION DIVISION.
PROGRAM-ID. BANNER-EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY 'CB_RASTER_GROUP.cpy'. *> New!
01 DUMB1 PIC X(2).          *> NOKAY
01 DUMB2 PIC 9(2).          *> OK

PROCEDURE DIVISION.
CALL 'PROC_BANNER' USING '876.543!' RETURNING DUMB1. *> RASTER-RESULTS.
IF RASTER_SUCCESS
    DISPLAY "Raster is well!"  *> New!
ELSE
    DISPLAY 'Rasterization Error?'.
DISPLAY "EXAMPLE6 ENDS".
GOBACK.

END PROGRAM BANNER-EXAMPLE.

COPY "PROC_BANNER6.cob".
