*> Mission: Demonstrate a Rasterization-In-Place (R.I.P).
*> GnuCOBOL: cobc -x -j -free BANNER_EXAMPLE.cob
*> Source: https://github.com/soft9000/COBOL/tree/master/TheCommons/BANNER
IDENTIFICATION DIVISION.
PROGRAM-ID. BANNER-EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "BIG_CHARS2.cpy".

01 BANNER_SIZE PIC 9 VALUE 8.

01 BANNER-GROUP.
   05 BANNER_FIELD PIC X(8)    VALUE ALL '?'.
   05 BANNER_ARRAY 
      REDEFINES BANNER_FIELD OCCURS 8 TIMES 
      INDEXED BY BANNER_ARRAY_SS.
      10 FILLER PIC X.

01 RASTER-GROUP.
   05 RASTER_BUFFER PIC X(648)  VALUE SPACES.
   05 RASTER_SEG REDEFINES RASTER_BUFFER OCCURS 72 TIMES
      INDEXED BY RASTER_SEG_SS.
      10 FILLER PIC X(9).
   05 RASTER_LINE REDEFINES RASTER_BUFFER OCCURS 9 TIMES
      INDEXED BY RASTER_LINE_SS.
      10 FILLER PIC X(72).

01 COUNTERS.
   05 SS1 PIC 9(4) VALUE 0.
   05 SS2 PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
DISPLAY ' '.
MOVE '12.34.56' TO BANNER_FIELD.
MOVE 1 TO SS1
MOVE 1 TO SS2
PERFORM VARYING BANNER_ARRAY_SS 
  FROM 1 BY 1 UNTIL BANNER_ARRAY_SS > BANNER_SIZE
    MOVE 1 TO SUBS
    SEARCH CHARS 
        AT END DISPLAY BANNER_ARRAY(BANNER_ARRAY_SS) ' NOT FOUND!'
            GOBACK
        WHEN BANNER_ARRAY(BANNER_ARRAY_SS) = CHAR_NAME OF CHARS(SUBS)
            *> DISPLAY 'GOT: [' CHAR_NAME OF CHARS(SUBS) ']'
 
            MOVE LINE_1 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_2 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_3 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_4 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_5 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_6 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_7 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_8 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            ADD BANNER_SIZE TO SS2
            MOVE LINE_9 OF CHARS(SUBS) TO RASTER_SEG(SS2)

            *> PERFORM DISPLAY_RASTER
            ADD 1 TO SS1
            MOVE BANNER_ARRAY_SS TO SS2
            ADD 1 TO SS2
            MULTIPLY SS2 BY SS1

        END-SEARCH
    END-PERFORM

PERFORM DISPLAY_RASTER.
DISPLAY ' '.
DISPLAY "EXAMPLE ENDS".

GOBACK.

DISPLAY_RASTER.
    PERFORM VARYING RASTER_LINE_SS 
    FROM 1 BY 1 UNTIL RASTER_LINE_SS > 9
    DISPLAY '['RASTER_LINE(RASTER_LINE_SS)']'
    END-PERFORM.

