*> Mission: Show how RECEIVING a COMPLEX STRUCTURE is NOT POSSIBLE.
*> GnuCOBOL: cobc -x -j -free BANNER_EXAMPLE7.cob
*> Source: https://github.com/soft9000/COBOL/tree/master/TheCommons/BANNER
IDENTIFICATION DIVISION.
PROGRAM-ID. BANNER-EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY 'CB_RASTER_IO.cpy'. *> New!

PROCEDURE DIVISION.
INITIALIZE RASTER-IO.
MOVE 'AB.CD.EF' TO BANNER_FIELD.
CALL 'PROC_BANNER' USING RASTER-IO.
IF RASTER_SUCCESS
    DISPLAY "Raster is well!"  *> New!
ELSE
    DISPLAY 'Rasterization Error?'.
DISPLAY "N.E.O.J".
GOBACK.

END PROGRAM BANNER-EXAMPLE.

COPY "PROC_BANNER7.cob".
