*> Mission: Show how to exchange a COMPLEX data STRUCTURE / GROUP. Caveats constants.
*> GnuCOBOL: cobc -x -j -free BANNER_EXAMPLE7.cob
*> Source: https://github.com/soft9000/COBOL/tree/master/TheCommons/BANNER
IDENTIFICATION DIVISION.
PROGRAM-ID. BANNER-EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY 'CB_RASTER_IO.cpy'. *> New!

01 RASTER_SS PIC 99.

PROCEDURE DIVISION.
INITIALIZE RASTER-IO.
MOVE 42 TO RASTER_RETURN_CODE.
MOVE 'AB.CD.EF' TO BANNER_FIELD.
CALL 'PROC_BANNER' USING RASTER-IO.
IF RASTER_SUCCESS
    DISPLAY "Raster is well!"  *> New!
    PERFORM VARYING RASTER_SS 
    FROM 1 BY 1 UNTIL RASTER_SS = 9 *> RASTER_LINES
    DISPLAY '['NINE_LINES(RASTER_SS)']'
    END-PERFORM
ELSE
    DISPLAY 'Rasterization Error?'.
DISPLAY "N.E.O.J".
GOBACK.

END PROGRAM BANNER-EXAMPLE.

COPY "PROC_BANNER7.cob".
