COPY "BIG_CHARS1.cpy".

01 CHARS REDEFINES CHAR_DATA OCCURS 91 TIMES INDEXED BY CHAR_SS.
   05 CHAR_NAME PIC X.
   05 LINE_1    PIC X(9).
   05 LINE_2    PIC X(9).
   05 LINE_3    PIC X(9).
   05 LINE_4    PIC X(9).
   05 LINE_5    PIC X(9).
   05 LINE_6    PIC X(9).
   05 LINE_7    PIC X(9).
   05 LINE_8    PIC X(9).
   05 LINE_9    PIC X(9).

 

