01 RASTER_SUCCESS_CODE      PIC 9(4) VALUE 1.
01 RASTER_ERROR_CODE        PIC 9(4) VALUE 9.
01 RASTER_LINES             PIC 9    VALUE 9. *> New?

01 RASTER-RESULTS.
   05 RASTER_RETURN_CODE        PIC 9.
      88 RASTER_SUCCESS         VALUE 1.
      88 RASTER_WARNING         VALUE 4.
      88 RASTER_EXCEPTION       VALUE 8.
      88 RASTER_ERROR           VALUE 9. 
   05 NINE_LINES OCCURS 9 TIMES.
      10 FILLER PIC X(72).

      
